app/controllers/api/v1/notes_controller.rb

SELECT "notes".* FROM "notes" ORDER BY notes.updated_at desc
---
    def index
      @notes = Note.order("notes.updated_at desc").all

INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "..."], ["body", "..."], ["created_at", "2022-11-20 00:26:32.200854"], ["updated_at", "2022-11-20 00:26:32.200854"]]
---
    def create
      @note = Note.new(title: "", body: "")

      if @note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "what really?"], ["body", "what really?"], ["updated_at", "2022-11-20 01:01:40.348525"], ["id", 3]]
---
    def update
      @note = Note.find(params[:id])

      if @note.update(note_params)